"use strict";

module.exports = {

  twitter: {
    consumer_key: "",
    consumer_secret: "",
    access_token: "",
    access_token_secret: ""
  },

  timezone: "Asia/Tokyo",

  excludePrevThemes: true,

  themes: [
    "ココア",
    "チノ",
    "リゼ",
    "千夜",
    "シャロ",
    "マヤ",
    "メグ",
    "青山ブルーマウンテン",
    "モカ"
  ],

  mainThemes: [
    "ココア",
    "チノ",
    "リゼ",
    "千夜",
    "シャロ",
    "マヤ",
    "メグ"
  ],

  subThemes: [
    "凛",
    "タカヒロ",
    "チノ母",
    "ココア母",
    "リゼ父",
    "千夜祖母",
    "メグ母",
    "ティッピー",
    "ワイルドギース",
    "あんこ",
    "吹き矢部の部長",
    "ココア千夜のクラスメイト"
  ],

  characterFree: [0],

  wordThemes: {

    words: [
      ["嬉しい", "楽しい", "笑う", "驚く"],
      ["手", "足", "髪", "口", "目"],
      ["コスプレ", "メガネ", "ヘアアクセサリー"],
      ["食べる", "寝る", "おしゃべり", "踊る", "歌う", "走る", "慌てる", "跳ねる", "泣く"],
      ["お茶会", "バリスタ", "うさぎ", "ティーカップ", "喫茶店", "家族", "写真", "姉妹"]
    ],

    date: [
      [12, 31, "正月"]
    ]

  }

};
